Revit 2027 API
CompoundStructure.CanSplitAndMergeRegionsBeUsed Method
 Checks whether split and merge regions operations can be used for this compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSplitAndMergeRegionsBeUsed()
Public Function CanSplitAndMergeRegionsBeUsed As Boolean
public:
bool CanSplitAndMergeRegionsBeUsed()
member CanSplitAndMergeRegionsBeUsed : unit -> bool
Return Value
Boolean
 True if split and merge regions operation can be used for this compound structure, false otherwise.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace